app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "theme", "email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Max"], ["theme", "Test theme"], ["email", "madmacj@gmail.com"], ["body", "Test message"], ["created_at", "2018-01-17 04:30:38.886486"], ["updated_at", "2018-01-17 04:30:38.886486"]]
---
  def create
    @contact = Contact.create(contact_params)