app/controllers/photos_controller.rb

INSERT INTO "photos" ("picture", "describtion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["picture", "iQ0XIhQ5M1g.jpg"], ["describtion", ""], ["created_at", "2018-02-03 21:52:13.116688"], ["updated_at", "2018-02-03 21:52:13.116688"]]
---
  def create
    @photo = Photo.new(photo_params)

    if @photo.save

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy