app/controllers/statics_controller.rb

  def index
    @page = params[:page] || 'home'
    if @page == "gallery"
      @photos = Photo.all
      @videos = Video.all
---
SELECT "photos".* FROM "photos"
SELECT "videos".* FROM "videos"