app/controllers/videos_controller.rb

INSERT INTO "videos" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @video = Video.new(video_params)

    if @video.save

DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @video.destroy

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def set_video
      @video = Video.find(params[:id])